const chapterList = [{
	"title": "第 一 回 甄士隐梦幻识通灵 贾雨村风尘怀闺秀",
	"number": 1
}, {
	"title": "第 二 回 贾夫人仙逝扬州城 冷子兴演说荣国府",
	"number": 2
}, {
	"title": "第 三 回 托内兄如海酬训教 接外孙贾母惜孤女",
	"number": 3
}, {
	"title": "第 四 回 薄命女偏逢薄命郎 葫芦僧乱判葫芦案",
	"number": 4
}, {
	"title": "第 五 回 游幻境指迷十二钗 饮仙醪曲演红楼梦",
	"number": 5
}, {
	"title": "第 六 回 贾宝玉初试云雨情 刘姥姥一进荣国府",
	"number": 6
}, {
	"title": "第 七 回 送宫花贾琏戏熙凤 宴宁府宝玉会秦钟",
	"number": 7
}, {
	"title": "第 八 回 比通灵金莺微露意 探宝钗黛玉半含酸",
	"number": 8
}, {
	"title": "第 九 回 恋风流情友入家塾 起嫌疑顽童闹学堂",
	"number": 9
}, {
	"title": "第 十 回 金寡妇贪利权受辱 张太医论病细穷源",
	"number": 10
}, {
	"title": "第十一回 庆寿辰宁府排家宴 见熙凤贾瑞起淫心",
	"number": 11
}, {
	"title": "第十二回 王熙凤毒设相思局 贾天祥正照",
	"number": 12
}, {
	"title": "第十三回 秦可卿死封龙禁尉 王熙凤协理宁国府",
	"number": 13
}, {
	"title": "第十四回 林如海捐馆扬州城 贾宝玉路谒北静王",
	"number": 14
}, {
	"title": "第十五回 王凤姐弄权铁槛寺 秦鲸卿得趣馒头庵",
	"number": 15
}, {
	"title": "第十六回 贾元春才选凤藻宫 秦鲸卿夭逝黄泉路",
	"number": 16
}, {
	"title": "第十七回 大观园试才题对额 荣国府归省庆元宵",
	"number": 17
}, {
	"title": "第十八回 隔珠帘父女勉忠勤 搦湘管姊弟裁题咏",
	"number": 18
}, {
	"title": "第十九回 情切切良宵花解语 意绵绵静日玉生香",
	"number": 19
}, {
	"title": "第二十回 王熙凤正言弹妒意 林黛玉俏语谑娇音",
	"number": 20
}, {
	"title": "第二十一回 贤袭人娇嗔箴宝玉 俏平儿软语救贾琏",
	"number": 21
}, {
	"title": "第二十二回 听曲文宝玉悟禅机 制灯谜贾政悲谶语",
	"number": 22
}, {
	"title": "第二十三回 西厢记妙词通戏语 牡丹亭艳曲警芳心",
	"number": 23
}, {
	"title": "第二十四回 醉金刚轻财尚义侠 痴女儿遗帕惹相思",
	"number": 24
}, {
	"title": "第二十五回 魇魔法叔嫂逢五鬼 红楼梦通灵遇双真",
	"number": 25
}, {
	"title": "第二十六回 蜂腰桥设言传密意 馆春困发幽情",
	"number": 26
}, {
	"title": "第二十七回 滴翠亭杨妃戏彩蝶 埋香冢飞燕泣残红",
	"number": 27
}, {
	"title": "第二十八回 蒋玉菡情赠茜香罗 薛宝钗羞笼红麝串",
	"number": 28
}, {
	"title": "第二十九回 享福人福深还祷福 痴情女情重愈斟情",
	"number": 29
}, {
	"title": "第三十回 宝钗借扇机带双敲 龄官划蔷痴及局外",
	"number": 30
}, {
	"title": "第三十一回 撕扇子作千金一笑 因麒麟伏白首双星",
	"number": 31
}, {
	"title": "第三十二回 诉肺腑心迷活宝玉 含耻辱情烈死金钏",
	"number": 32
}, {
	"title": "第三十三回 手足眈眈小动唇舌 不肖种种大承笞挞",
	"number": 33
}, {
	"title": "第三十四回 情中情因情感妹妹 错里错以错劝哥哥",
	"number": 34
}, {
	"title": "第三十五回 白玉钏亲尝莲叶羹 黄金莺巧结梅花络",
	"number": 35
}, {
	"title": "第三十六回 绣鸳鸯梦兆绛芸轩 识分定情悟梨香院",
	"number": 36
}, {
	"title": "第三十七回 秋爽斋偶结海棠社 蘅芜苑夜拟菊花题",
	"number": 37
}, {
	"title": "第三十八回 林魁夺菊花诗 薛蘅芜讽和螃蟹咏",
	"number": 38
}, {
	"title": "第三十九回 村姥姥是信口开河 情哥哥偏寻根究底",
	"number": 39
}, {
	"title": "第四十回 史太君两宴大观园 金鸳鸯三宣牙牌令",
	"number": 40
}, {
	"title": "第四十一回 贾宝玉品茶栊翠庵 刘姥姥醉卧怡红院",
	"number": 41
}, {
	"title": "第四十二回 蘅芜君兰言解疑癖 子雅谑补馀香",
	"number": 42
}, {
	"title": "第四十三回 闲取乐偶攒金庆寿 不了情暂撮土为香",
	"number": 43
}, {
	"title": "第四十四回 变生不测凤姐泼醋 喜出望外平儿理妆",
	"number": 44
}, {
	"title": "第四十五回 金兰契互剖金兰语 风雨夕闷制风雨词",
	"number": 45
}, {
	"title": "第四十六回 尴尬人难免尴尬事 鸳鸯女誓绝鸳鸯偶",
	"number": 46
}, {
	"title": "第四十七回 呆霸王调情遭苦打 冷郎君惧祸走他乡",
	"number": 47
}, {
	"title": "第四十八回 滥情人情误思游艺 慕雅女雅集苦吟诗",
	"number": 48
}, {
	"title": "第四十九回 琉璃世界白雪红梅 脂粉香娃割腥啖膻",
	"number": 49
}, {
	"title": "第五十回 芦雪庵争联即景诗 暖香坞雅制春灯谜",
	"number": 50
}, {
	"title": "第五十一回 薛小妹新编怀古诗 胡庸医乱用虎狼药",
	"number": 51
}, {
	"title": "第五十二回 俏平儿情掩虾须镯 勇晴雯病补雀金裘",
	"number": 52
}, {
	"title": "第五十三回 宁国府除夕祭宗祠 荣国府元宵开夜宴",
	"number": 53
}, {
	"title": "第五十四回 史太君破陈腐旧套 王熙凤效戏彩斑衣",
	"number": 54
}, {
	"title": "第五十五回 辱亲女愚妾争闲气 欺幼主刁奴蓄险心",
	"number": 55
}, {
	"title": "第五十六回 敏探春兴利除宿弊 识宝钗小惠全大体",
	"number": 56
}, {
	"title": "第五十七回 慧紫鹃情辞试忙玉 慈姨妈爱语慰痴颦",
	"number": 57
}, {
	"title": "第五十八回 杏子阴假凤泣虚凰 茜纱窗真情揆痴理",
	"number": 58
}, {
	"title": "第五十九回 柳叶渚边嗔莺咤燕 绛芸轩里召将飞符",
	"number": 59
}, {
	"title": "第六十回 茉莉粉替去蔷薇硝 玫瑰露引来茯苓霜",
	"number": 60
}, {
	"title": "第六十一回 投鼠忌器宝玉瞒赃 判冤决狱平儿行权",
	"number": 61
}, {
	"title": "第六十二回 憨湘云醉眠芍药裀 呆香菱情解石榴裙",
	"number": 62
}, {
	"title": "第六十三回 寿怡红群芳开夜宴 死金丹独艳理亲丧",
	"number": 63
}, {
	"title": "第六十四回 幽淑女悲题五美吟 浪荡子情遗九龙佩",
	"number": 64
}, {
	"title": "第六十五回 贾二舍偷娶尤二姨 尤三姐思嫁柳二郎",
	"number": 65
}, {
	"title": "第六十六回 情小妹耻情归地府 冷二郎一冷入空门",
	"number": 66
}, {
	"title": "第六十七回 见土仪颦卿思故里 闻秘事凤姐讯家童",
	"number": 67
}, {
	"title": "第六十八回 苦尤娘赚入大观园 酸凤姐大闹宁国府",
	"number": 68
}, {
	"title": "第六十九回 弄小巧用借剑杀人 觉大限吞生金自逝",
	"number": 69
}, {
	"title": "第七十回 林黛玉重建桃花社 史湘云偶填柳絮词",
	"number": 70
}, {
	"title": "第七十一回 嫌隙人有心生嫌隙 鸳鸯女无意遇鸳鸯",
	"number": 71
}, {
	"title": "第七十二回 王熙凤恃强羞说病 来旺妇倚势霸成亲",
	"number": 72
}, {
	"title": "第七十三回 痴丫头误拾绣春囊 懦小姐不问累金凤",
	"number": 73
}, {
	"title": "第七十四回 惑奸谗抄检大观园 矢孤介杜绝宁国府",
	"number": 74
}, {
	"title": "第七十五回 开夜宴异兆发悲音 赏中秋新词得佳谶",
	"number": 75
}, {
	"title": "第七十六回 凸碧堂品笛感凄清 凹晶馆联诗悲寂寞",
	"number": 76
}, {
	"title": "第七十七回 俏丫鬟抱屈夭风流 美优伶斩情归水月",
	"number": 77
}, {
	"title": "第七十八回 老学士闲徵姽嫿词 痴公子杜撰芙蓉诔",
	"number": 78
}, {
	"title": "第七十九回 薛文龙悔娶河东狮 贾迎春误嫁中山狼",
	"number": 79
}, {
	"title": "第八十回 美香菱屈受贪夫棒 王道士胡诌妒妇方",
	"number": 80
}, {
	"title": "第八十一回 占旺相四美钓游鱼 奉严词两番入家塾",
	"number": 81
}, {
	"title": "第八十二回 老学究讲义警顽心病痴魂惊恶梦",
	"number": 82
}, {
	"title": "第八十三回 省宫闱贾元妃染恙 闹闺阃薛宝钗吞声",
	"number": 83
}, {
	"title": "第八十四回 试文字宝玉始提亲 探惊风贾环重结怨",
	"number": 84
}, {
	"title": "第八十五回 贾存周报升郎中任 薛文起复惹放流刑",
	"number": 85
}, {
	"title": "第八十六回 受私贿老官翻案牍 寄闲情淑女解琴书",
	"number": 86
}, {
	"title": "第八十七回 感秋声抚琴悲往事 坐禅寂走火入邪魔",
	"number": 87
}, {
	"title": "第八十八回 博庭欢宝玉赞孤儿 正家法贾珍鞭悍仆",
	"number": 88
}, {
	"title": "第八十九回 人亡物在公子填词 蛇影杯弓颦卿绝粒",
	"number": 89
}, {
	"title": "第九十回 失绵衣贫女耐嗷嘈 送果品小郎惊叵测",
	"number": 90
}, {
	"title": "第九十一回 纵淫心宝蟾工设计 布疑阵宝玉妄谈禅",
	"number": 91
}, {
	"title": "第九十二回 评女传巧姐慕贤良 顽母珠贾政参聚散",
	"number": 92
}, {
	"title": "第九十三回 甄家仆投靠贾家门 水月庵掀翻风月案",
	"number": 93
}, {
	"title": "第九十四回 宴海棠贾母赏花妖 失宝玉通灵知奇祸",
	"number": 94
}, {
	"title": "第九十五回 因讹成实元妃薨逝以假混真宝玉疯颠",
	"number": 95
}, {
	"title": "第九十六回 瞒消息凤姐设奇谋 泄机关颦儿迷本性",
	"number": 96
}, {
	"title": "第九十七回 林黛玉焚稿断痴情 薛宝钗出闺成大礼",
	"number": 97
}, {
	"title": "第九十八回 苦绛珠魂归离恨天 病神瑛泪洒相思地",
	"number": 98
}, {
	"title": "第九十九回 守官箴恶奴同破例 阅邸报老舅自担惊",
	"number": 99
}, {
	"title": "第一百回 破好事香菱结深恨 悲远嫁宝玉感离情",
	"number": 100
}, {
	"title": "第一百零一回 大观园月夜警幽魂 散花寺神签占异兆",
	"number": 101
}, {
	"title": "第一百零二回 宁国府骨肉病灾祲 大观园符水驱妖孽",
	"number": 102
}, {
	"title": "第一百零三回 施毒计金桂自焚身 昧真禅雨村空遇旧",
	"number": 103
}, {
	"title": "第一百零四回 醉金刚小鳅生大浪 痴公子馀痛触前情",
	"number": 104
}, {
	"title": "第一百零五回 锦衣军查抄宁国府 骢马使弹劾平安州",
	"number": 105
}, {
	"title": "第一百零六回 王熙凤致祸抱羞惭 贾太君祷天消灾患",
	"number": 106
}, {
	"title": "第一百零七回 散馀资贾母明大义 复世职政老沐天恩",
	"number": 107
}, {
	"title": "第一百零八回 强欢笑蘅芜庆生辰 死缠绵闻鬼哭",
	"number": 108
}, {
	"title": "第一百零九回 候芳魂五儿承错爱还孽债迎女返真元",
	"number": 109
}, {
	"title": "第一百一十回 史太君寿终归地府 王凤姐力诎失人心",
	"number": 110
}, {
	"title": "第一百一十一回 鸳鸯女殉主登太虚 狗彘奴欺天招伙盗",
	"number": 111
}, {
	"title": "第一百一十二回 活冤孽妙姑遭大劫 死雠仇赵妾赴冥曹",
	"number": 112
}, {
	"title": "第一百一十三回 忏宿冤凤姐托村妪 释旧憾情婢感痴郎",
	"number": 113
}, {
	"title": "第一百一十四回 王熙凤历幻返金陵 甄应嘉蒙恩还玉阙",
	"number": 114
}, {
	"title": "第一百一十五回 惑偏私惜春矢素志 证同类宝玉失相知",
	"number": 115
}, {
	"title": "第一百一十六回 得通灵幻境悟仙缘 送慈柩故乡全孝道",
	"number": 116
}, {
	"title": "第一百一十七回 阻超凡佳人双护玉 欣聚党恶子独承家",
	"number": 117
}, {
	"title": "第一百一十八回 记微嫌舅兄欺弱女 警谜语妻妾谏痴人",
	"number": 118
}, {
	"title": "第一百一十九回 中乡魁宝玉却尘缘 沐皇恩贾家延世泽",
	"number": 119
}, {
	"title": "第一百二十回 甄士隐详说太虚情 贾雨村归结红楼梦",
	"number": 120
}];

const chapterContent = {
	"content": "\r\n    此开卷第一回也。作者自云，因曾历过一番梦幻之后，故将真事隐去，而借“通灵”之说，撰此石头记一书也。故曰“甄士隐”云云。但书中所记何事何人，自又云，今风尘碌碌一事无成，忽念及当日所有之女子，一一细考较去，觉其行止见识皆出于我之上，何我堂堂须眉诚不若彼裙钗哉，实愧则有馀，悔又无益之大无可如何之日也。当此时，自欲将已往所赖天恩祖德，锦衣纨袴之时，饫甘餍肥之日，背父兄教育之恩，负师友规谈之德，以致今日一技无成半生潦倒之罪，编述一集以告天下人，虽我之罪固不能免，然闺阁中本自历历有人，万不可因我之不肖，自护己短，一并使其泯灭也。虽今日之茅椽蓬牖，瓦灶绳床，其风晨月夕，阶柳庭花，亦未有妨我之襟怀笔墨者，虽我未学，下笔无文，又何妨用假语村言敷演出一段故事来，以悦人之耳目哉。故曰“贾雨村”云云。乃是第一回题纲正义也。开卷即云“风尘怀闺秀”，则知作者本意原为记述当日闺友闺情，并非怨世骂时之书矣；虽一时有涉于世态，然亦不得不叙者，但非其本旨耳。阅者切记之。诗曰：\r\n    浮生着甚苦奔忙，盛席华筵终散场。悲喜千般同幻泡，古今一梦尽荒唐。谩言红袖啼痕重，更有情痴抱恨长。字字看来皆是血，十年辛苦不寻常。\r\n    列位看官，你道此书何来，说起根由虽近荒唐，细按则深有趣味，待在下将此来历注明，方使阅者了然不『惑』。\r\n    原来女娲氏炼石补天之时，于大荒山无稽崖炼成高经十二丈，方经二十四丈顽石三万六千五百零一块。娲皇氏只用了三万六千五百块，只单单的剩了一块未用，便弃在此山青埂峰下。谁知此石自经煅炼之后，灵『性』已通，因见众石俱得补天，独自己无材不堪入选，遂自怨自叹，日夜悲号惭愧。一日正当嗟悼之际，俄见一僧一道远远而来，生得骨格不凡，丰神迥别，说说笑笑来至峰下，坐于石边，高谈快论。先是说些云山雾海神仙玄幻之事；后便说到红尘中荣华富贵。此石听了，不觉打动凡心，也想要到人间去享一享这荣华富贵；但自恨粗蠢，不得已便口吐人言，向那僧道说道：“大师，弟子蠢物不能见礼了。适闻二位谈那人世间荣耀繁华，心切慕之。弟子质虽粗蠢，『性』却稍通，况见二师仙形道体，定非凡品，必有补天济世之材，利物济人之德，如蒙发一点慈心，携带弟子得入红尘，在那富贵场中温柔乡里受享几年，自当永佩洪恩，万劫不忘也。”二仙师听毕，齐憨笑道：“善哉，善哉。那红尘中却有些乐事，但不能永远依恃；况又有‘美中不足，好事多魔’八个字紧相联属，瞬息间则又乐极悲生，人非物换，究竟是到头一梦，万境归空，倒不如不去的好。”这石凡心已炽，那里听得进这话去，乃复苦求再四。二仙知不可强制，乃叹道：“此亦静极思动，无中生有之数也。既如此，我们便携你去受享受享，只是到不得意时，切莫后悔。”石道：“自然，自然。”那僧又道：“若说你『性』灵，却又如此质蠢，并更无奇贵之处，如此也只好踮脚而已。也罢，我如今大施佛法助你助，待劫终之日，复还本质，以了此案。你道好否？”石头听了，感谢不尽。那僧便念咒书符，大展幻术，将一块大石登时变成一块鲜明莹洁的美玉，且又缩成扇坠大小的可佩可拿。那僧托于掌上，笑道：“形体倒也是个宝物了，还只没有实在的好处，须得再镌上数字，使人一见便知是奇物方妙；然后好携你到那昌明隆盛之邦，诗礼簪缨之族，花柳繁华地，温柔富贵乡去安身乐业。”石头听了，喜之不尽，乃问道：“不知赐了弟子那几件奇处，又不知携了弟子到何地方，望乞明示，使弟子不『惑』。”那僧笑道：“你且莫问，日后自然明白的。”说着便袖笼了这石，同那道人飘然而去，竟不知投奔何方何舍。后来又不知过了几世几劫，因有个空空道人访道求仙，从这大荒山无稽崖青埂峰下经过，忽见大块石上字迹分明，编述历历。空空道人乃从头一看，原来就是无材补天，幻形入世，蒙茫茫大士渺渺真人携入红尘，历尽离合悲欢炎凉世态的一段故事，后面又有一首偈云：\r\n    “无材可去补苍天，枉入红尘若许年。此系身前身后事，倩谁记去作奇传。”\r\n    诗后便是此石坠落之乡，投胎之处，亲自经历的一段陈迹故事。其中家庭闺阁琐事以及闲情诗词倒还全备，或可适趣解闷，然朝代年纪地舆邦国，却反失落无考。空空道人遂向石头说道：“石兄，你这一段故事，据你自己说有些趣味，故编写在此，意欲问世传奇。据我看来，第一件无朝代年纪可考，第二件并无大贤大忠理朝廷治风俗的善政；其中只不过几个异样女子，或情或痴，或小才微善，亦无班姑蔡女之德能。我纵抄去，恐世人不爱看呢。”石头笑答曰：“我师何太痴也！若云无朝代可考，今我师竟假借汉唐等年纪添缀，又有何难。但我想历来野史皆蹈一辙，莫如我不借此套者反倒新奇别致，不过只取其事体情理罢了，又何必拘拘于朝代年纪哉。再者，市井俗人喜看理治之书者甚少，爱看适趣闲文者特多。历来野史，或讪谤君相，或贬人妻女，『奸』『淫』凶恶不可胜数；更有一种风月笔墨，其『淫』污秽臭，荼毒笔墨，坏人子弟，又不可胜数；至若佳人才子等书，则又千部共出一套，且其中终不能不涉于『淫』滥，以致满纸潘安子建西子文君，不过作者要写出自己的那两首情诗艳赋来，故假拟出男女二人名姓，又必傍出一小人其间拨『乱』，亦如剧中之小丑然，且鬟婢开口，即者也之乎非文即理。故逐一看去，悉皆自相矛盾大不近情理之说，竟不如我半世亲睹亲闻的这几个女子，虽不敢说强似前代所有书中之人，但事迹原委亦可以消愁破闷，也有几首歪诗熟词可以喷饭供酒；至若离合悲欢，兴衰际遇，则又追踪蹑迹，不敢稍加穿凿，徒为哄人之目而反失其真传者。今之人，贫者日为衣食所累，富者又怀不足之心，纵一时稍闲，又有贪『淫』恋『色』好货寻愁之事，那里有工夫去看那理治之书。所以我这一段故事，也不愿世人称奇道妙，也不定要世人喜悦检读，只愿他们当那醉馀饱卧之时，或避世去愁之际，把此一顽，岂不省了些寿命筋力，就比那谋虚逐妄，却也省了口舌是非之害，腿脚奔忙之苦；再者亦令世人换新眼目，不比那些胡牵『乱』扯，忽离忽遇，满纸才人淑女子建文君红娘小玉等，通共熟套之旧稿。我师以为何如？”空空道人听如此说，思忖半晌，将这石头记再细阅一遍，因见上面虽有些指『奸』责佞贬恶诛邪之语，亦非伤时骂世之旨；乃至君仁臣良父慈子孝，凡伦常所关之处，皆是称功颂德眷眷无穷，实非别书之可比。虽其中大旨谈情，亦不过实录其事，又非假拟妄称，一味『淫』邀艳约私讨偷盟之可比。因毫不干涉时世，方从头至尾抄录回来，问世传奇；因空见『色』，由『色』生情，传情入『色』，自『色』悟空，遂易名为情僧，改“石头记”为“情僧录”。东鲁孔梅溪则题曰“风月宝鉴”。后因曹雪芹于悼红轩中披阅十载，增删五次，纂成目录，分出章回，则题曰“金陵十二钗”。并题一绝云：\r\n    “满纸荒唐言，一把辛酸泪。都云作者痴，谁解其中味。”\r\n    出则既明，且看石上是何故事。按那石上书云：当日地陷东南，这东南一隅有处曰姑苏，有城曰阊门者，最是红尘中一二等富贵风流之地。这阊门外有个十里街，街内有个仁清巷，巷内有个古庙，因地方窄狭，人皆呼作葫芦庙。庙傍住着一家乡宦，姓甄，名费，字士隐。嫡妻封氏，情『性』贤淑，深明礼义。家中虽不甚富贵，然本地便也推他为望族了。因这甄士隐禀『性』恬淡，不以功名为念，每日只以观花修竹酌酒『吟』诗为乐，倒是神仙一流人品。只是一件不足，如今年已半百，膝下无儿，只有一女，『乳』名英莲，年方三岁。一日，炎夏永昼，士隐于书房闲坐，至手倦抛书，伏几少憩，不觉朦胧睡去，梦至一处，不辨是何地方。忽见那厢来了一僧一道，且行且谈。只听道人问道：“你携了这蠢物，意欲何往？”那僧笑道：“你放心，如今现有一段风流公案正该了结，这一干风流冤家尚未投胎入世，趁此机会就将此蠢物夹带于中，使他去经历经历。”那道人道：“原来近日风流冤孽又将造劫历世去不成。但不知落于何方何处？”那僧笑道：“此事说来好笑，竟是千古未闻的罕事。只因西方灵河岸上三生石畔有绛珠草一株，时有赤瑕宫神瑛侍者日以甘『露』灌溉，这绛珠草始得久延岁月。后来既受天地精华，复得雨『露』滋养，遂得脱却草胎木质得换人形，仅修成个女体，终日游于离恨天外，饥则食蜜青果为膳，渴则饮灌愁海水为汤；只因尚未酬报灌溉之德，故其五衷便郁结着一段缠绵不尽之意。恰近日这神瑛侍者凡心偶炽，乘此昌明太平朝世，意欲下凡，造历幻缘，已在警幻仙子案前挂了号。警幻亦曾问及灌溉之情未偿，趁此倒可了结的。那绛珠仙子道：‘他是甘『露』之惠，我并无水可还。他既下世为人，我也去下世为人，但把我一生所有的眼泪还他，也偿还得过他了。’因此一事，就勾出多少风流冤家来，陪他们去了结此案。”那道人道：“果是罕闻，实未闻有还泪之说。想来这一段故事比历来风月故事更加琐碎细腻了。”那僧道：“历来几个风流人物，不过传其大概以及诗词篇章而已，至家庭闺阁中一饮一食总未述记；再者，大半风月故事，不过偷香窃玉暗约私奔而已，并不曾将儿女之真情发泄一二。想这一干人入世，其情痴『色』鬼贤愚不肖者，悉与前人传述不同矣。”那道人道：“趁此何不你我也去下世度脱几个，岂不是一场功德。”那僧道：“正合吾意。你且同我到警幻仙子宫中将这蠢物交割清楚。待这一干风流孽鬼下世已完，你我再去。如今虽已有一半落尘，然犹未全集。”道人道：“既如此，便随你去来。”却说甄士隐俱听得明白，但不知所云蠢物系何东西，遂不禁上前施礼，笑问道：“二仙师请了。”那僧道也答礼相问。士隐因说道：“适闻仙师所谈因果实人世罕闻者，但弟子愚浊不能洞悉明白，若蒙大开痴顽，备细一闻，弟子则洗耳谛听，稍能警省，亦可免沉沦之苦。”二仙笑道：“此乃玄机不可预泄者，到那时只不要忘了我二人，便可跳出火坑矣。”士隐听了，不便再问，因笑道：“玄机不可预泄，但适云蠢物不知为何，或可一见否？”那僧道：“若问此物，倒有一面之缘。”说着，取出递与士隐。士隐接了看时，原是块鲜明美玉，上面字迹分明，镌着“通灵宝玉”四字，后面还有几行小字。正欲细看时，那僧便说已到幻境，便强从手中夺了去，与道人竟过一大石牌坊，上书四个大字乃是“太虚幻境”，两边又有一副对联，道是：\r\n    “假作真时真亦假，无为有处有还无。”\r\n    士隐意欲也跟了过去，方举步时，忽听一声霹雳，有若山崩地陷。士隐大叫一声，定睛一看，只见烈日炎炎，芭蕉冉冉，梦中之事便忘了对半。又见『奶』母正抱了英莲走来。士隐见女儿越发生得粉妆玉琢，乖觉可喜，便伸手接来，抱在怀中，逗他顽耍一回，又带至街前，看那过会的热闹。方欲进来时，只见从那边来了一僧一道，那僧则癞头跣脚，那道则跛足蓬头，疯疯颠颠，挥霍谈笑而至。及到了他门前，看见士隐抱着英莲，那僧便大哭起来，又向士隐道：“施主，你把这有命无运累及爹娘之物，抱在怀内作甚！”士隐听了，知是疯话，也不去睬他。那僧还说：“舍我罢，舍我罢！”士隐不耐烦，便抱女儿撤身要进去，那僧乃指着他大笑，口内念了四句言词道：\r\n    “惯养娇生笑你痴，菱花空对雪澌澌。好防佳节元宵后，便是烟消火灭时。”\r\n    士隐听得明白，心下犹豫，意欲问他们来历，只听道人说道：“你我不必同行，就此分手，各干营生去罢。三劫后，我在北邙山等你，会齐了，同往太虚幻境销号。”那僧道：“最妙，最妙。”说毕，二人一去，再不见个踪影了。士隐心中此时自忖，这两个人必有来历，该试一问，如今悔却晚也。\r\n    这士隐正痴想，忽见隔壁葫芦庙内，寄居一个穷儒，姓贾名化，表字时飞，别号雨村者，走了出来。这贾雨村原系湖州人氏，也是诗书仕宦之族，因他生于末世，父母祖宗根基已尽，人口衰丧，只剩得他一身一口，在家乡无益，因进京求取功名，再整基业。自前岁来此，又淹蹇住了，暂寄庙中安身，每日卖字作文为生，故士隐常与他交接。当下雨村见了士隐，忙施礼陪笑道：“老先生倚门伫望，敢街市上有甚新闻否？”士隐笑道：“非也。适因小女啼哭，引他出来作耍，正是无聊之甚。兄来得正妙，请入小斋一谈，彼此皆可消此永昼。”说着便令人送女儿进去，自携了雨村来至书房中。小童献茶，方谈得三五句话，忽家人飞报严老爷来拜。士隐慌的忙起身谢罪道：“恕诳驾之罪，略坐，弟即来陪。”雨村忙起身亦让道：“老先生请便。晚生乃常造之客，稍候何妨。”说着，士隐已出前厅去了。这里雨村且翻弄书籍解闷。忽听得窗外有女子嗽声，雨村遂起身往窗外一看，原来是一个丫鬟在那里掐花，生得仪容不俗，眉目清明，虽无十分姿『色』，却也有动人之处，雨村不觉看得呆了。那甄家丫鬟掐了花，方欲走时，猛抬头见窗内有人，敝巾旧服虽是贫窘，然生得腰宽背厚，面阔口方，更兼剑眉星眼，直鼻权腮。这丫鬟忙转身回避，心下乃想：“这人生得这样雄壮，却又这样蓝缕，想他定是我家主人常说的什么贾雨村了，每有意帮助周济，只是无甚机会。我家并无这样贫窘亲友，想定是此人无疑了。怪道又说他必非久困之人。”如此想，不免又回头两次。雨村见他回头，便以为这女子心中有意于他，便狂喜不禁，自为此女子必是个巨眼英豪，风尘中之知己也。一时小童进来，雨村打听得前面留饭，不可久待，遂从夹道中自便出门去了。士隐待客既散，知雨村自便，也不去再邀。\r\n    一日，早又中秋佳节，士隐家宴已毕，乃又另具一席于书房，却自己步月至庙中来邀雨村。原来雨村自那日见了甄家之婢，曾回顾他两次，自为是个知己，便时刻放在心上。今又正值中秋，不免对月有怀，因而口占五言一律云：\r\n    “未卜三生愿，频添一段愁。闷来时敛额，行去几回头。自顾风前影，谁堪月下俦。蟾光如有意，先上玉人楼。”\r\n    雨村『吟』罢，因又思及平生抱负苦未逢时，乃又搔首对天长叹，复高『吟』一联云：\r\n    “玉在椟中求善价，钗于奁内待时飞。”\r\n    恰值士隐走来听见，笑道：“雨村兄真抱负不浅也！”雨村忙笑道：“岂敢。不过偶『吟』前人之句，何敢狂诞至此。”因问“老先生何兴至此？”士隐笑道：“今夜中秋，俗谓团圆之节，想尊兄旅寄僧房，不无寂寥之感，故特具小酌，邀兄到敝斋一饮，不知可纳芹意否？”雨村听了，并不推辞，便笑道：“既蒙谬爱，何敢拂此盛情。”说着，便同士隐过这边书院中来。须臾茶毕，早已设下杯盘，那美酒佳肴自不必说。二人归坐，先是款斟慢饮，渐次谈至兴浓，不觉飞觥限斝起来。当时街坊上家家箫管，户户弦歌，当头一轮明月飞彩凝辉，二人愈添豪兴，酒到杯干。雨村此时已有七八分酒意，狂兴不禁，乃对月寓怀，口号一绝云：\r\n    “时逢三五便团圆，满把晴光护玉栏。天上一轮才捧出，人间万姓仰头看。”\r\n    士隐听了，大叫妙哉，“吾每谓兄必非久居人下者，今所『吟』之句，飞腾之兆已见，不日可得接步履于云霓之上矣。可贺可贺。”乃亲斟一斗为贺。雨村因干过，叹道：“非晚生酒后狂言，若论时尚之学，晚生也或可去充数沽名，只是目今行囊路费一概无措，神京路远，非赖卖字撰文即能到者。”士隐不待说完，便道：“兄何不早言。愚每有此心，但每遇兄时，兄并未谈及，愚故未敢唐突。今既及此，愚虽不才，义利二字却还识得。且喜明岁正当大比，兄宜作速入都，春闱一战，方不负兄之所学也。其盘费馀事弟自代为处置，亦不枉兄之谬识矣。”当下即命小童进去，速封五十两白银并两套冬衣。又云：“十九日乃黄道之期，兄可即买舟西上，待雄飞高举，明冬再晤，岂非大快之事耶！”雨村收了银衣，不过略谢一语，并不介意，仍是吃酒谈笑。那天已交三鼓，二人方散。士隐送雨村去后，回房一觉，直至红日三竿方醒。因思昨夜之事，意欲再写两封荐书与雨村带至都中去，使雨村投谒个仕宦之家，为寄足之地。因使人过去请时，那家人去了回来说：“和尚说，贾爷今日五鼓已进京去了，也曾留下话与和尚转达老爷，说读书人不在黄道黑道，总以事理为要，不及面辞了。”士隐听了，也只得罢了。\r\n    真是闲处光阴易过，倏忽又是元宵佳节矣。因士隐命家人霍启抱了英莲去看社火花灯，半夜中霍启因要小解，便将英莲放在一家门槛上坐着，待他小解完了来抱时，那有英莲的踪影。急得霍启直寻了半夜，至天明不见，那霍启也就不敢回来见主人，便逃往他乡去了。那士隐夫『妇』见女儿一夜不归，便知有些不妥，再使几人去寻找，回来皆云连音响全无。夫妻二人半世只生此女，一旦失落，岂不思想，因此昼夜啼哭，几乎不曾寻死。看看的一月，士隐先就得了一病，当时封氏孺人也因思女构疾，日日请医调治。不想这日三月十五，葫芦庙中炸供，那些和尚不加小心，致使油锅火逸，便烧着窗纸。此方人家多用竹篱木壁，大抵也因劫数，于是接二连三，牵五挂四，将一条街烧得如火焰山一般。彼时虽有军民来救，那火已成了势，如何救得下，直烧了一夜方渐渐的熄去，也不知烧了几家。只可怜甄氏在隔壁，早已烧成一片瓦砾场了，只有他夫『妇』并几个家人的『性』命不曾伤了。急得士隐惟跌足长叹而已。只得与妻子商议，且到田庄上去安身。偏值近年水旱不收，鼠盗蜂起，无非抢田夺地，民不安生，因此官兵剿捕，难以安身。士隐只得将田庄都折变了，便携了妻子与两个丫鬟，投他岳丈家去。他岳丈名唤封肃，本贯大如州人氏，虽是务农，家中都还殷实。今见女婿这等狼狈而来，心中便有些不乐。幸而士隐还有折变田产的银子未曾用完，拿出来托他随分就价置些房地，为后日衣食之计。那封肃便半哄半赚，些须与他些薄田朽屋。士隐乃读书之人，不惯生理稼穑等事，勉强支持了一二年，越觉穷了下去。封肃每见面时，便说些现成话；且人前人后，又怨他们不善过活，只一味好吃懒做等语。士隐知投人不着，心中未免悔恨；再兼上年惊吓，急忿怨痛，已有积伤：暮年之人贫病交攻，竟渐渐的『露』出那下世的光景来。可巧这日拄了拐，挣扎到街前散散心时，忽见那边来了一个跛足道人，疯狂落拓，麻屣鹑衣，口内念着几句言词道：\r\n    世人都晓神仙好，惟有功名忘不了，\r\n    古今将相在何方，荒塚一堆草没了。\r\n    世人都晓神仙好，只有金银忘不了，\r\n    终朝只恨聚无多，及至多时眼闭了。\r\n    世人都晓神仙好，只有娇妻忘不了，\r\n    君生日日说恩情，君死又随人去了。\r\n    世人都晓神仙好，只有儿孙忘不了，\r\n    痴心父母古来多，孝顺儿孙谁见了。\r\n    士隐听了，便迎上来道：“你满口说些什么？只听见些‘好了’‘好了’。”那道人笑道：“你若果听见‘好了’二字还算你明白。可知世上万般，‘好’便是‘了’，‘了’便是‘好’；若不‘了’，便不‘好’；若要‘好’，须是‘了’。我这歌儿便名‘好了歌’。”士隐本是有宿慧的，一闻此言，心中早已彻悟，因笑道：“且住，待我将你这‘好了歌’解注出来何如？”道人笑道：“你解，你解。”士隐乃说道：\r\n    “陋室空堂，当年笏满床。衰草枯杨，曾为歌舞场。蛛丝儿结满雕梁，绿纱今又糊在蓬窗上。说甚么脂正浓，粉正香，如何两鬓又成霜。昨日黄土陇头送白骨，今宵红灯帐底卧鸳鸯。金满箱，银满箱，转眼乞丐人皆谤。正叹他人命不长，那知自己归来丧。训有方，保不定日后做强梁。择膏粱，谁承望流落在烟花巷。因嫌纱帽小，致使锁枷扛。昨怜破袄寒，今嫌紫蟒长。『乱』烘烘，你方唱罢我登场，反认他乡是故乡。甚荒唐。到头来，都是为他人做嫁衣裳。”\r\n    那疯跛道人听了拍掌笑道：“解得切，解得切！”士隐便说一声：“走罢！”将道人肩上搭连抢了过来背着，竟不回家，同了疯道人飘飘而去。当下烘动街坊众人，当做一件新闻传说。封氏闻得此信，哭个死去活来，只得与父亲商议，遣人各处访寻，那讨音信。无奈何，少不得依靠着他父母度日。幸而身边还有两个旧日的丫鬟伏侍，主仆三人日夜做些针线发卖，帮着父亲用度。那封肃虽然日日抱怨，也无可如何了。\r\n    这日甄家大丫头在门前买线，忽听街上喝道之声，众人都说新太爷到任。丫鬟隐在门内看时，只见军牢快手一对一对的过去，俄而大轿内抬着一个乌纱猩袍的官府过去。丫鬟倒发了个怔，自忖这官好面善，倒像在那里见过的。于是进入房中，也就丢过不在心上。至晚间正待歇息之时，忽听一片声打的门响，许多人『乱』嚷，说本府太爷的差人来传人问话。封肃听了，吓得目瞪口呆。不知有何祸事，且听下回分解。\r\n"
}

export default {
	chapterContent,
	chapterList
}
