const chapterList = [{
	"title": "第 一 回 甄士隐梦幻识通灵 贾雨村风尘怀闺秀",
	"number": 1
}, {
	"title": "第 二 回 贾夫人仙逝扬州城 冷子兴演说荣国府",
	"number": 2
}, {
	"title": "第 三 回 托内兄如海酬训教 接外孙贾母惜孤女",
	"number": 3
}, {
	"title": "第 四 回 薄命女偏逢薄命郎 葫芦僧乱判葫芦案",
	"number": 4
}, {
	"title": "第 五 回 游幻境指迷十二钗 饮仙醪曲演红楼梦",
	"number": 5
}, {
	"title": "第 六 回 贾宝玉初试云雨情 刘姥姥一进荣国府",
	"number": 6
}, {
	"title": "第 七 回 送宫花贾琏戏熙凤 宴宁府宝玉会秦钟",
	"number": 7
}, {
	"title": "第 八 回 比通灵金莺微露意 探宝钗黛玉半含酸",
	"number": 8
}];

const chapterContent = {
	"content": "天还没有亮，十万里大荒一片昏暗，但阳光却已经照耀在剑门山之上，只见这座奇山半山腰处云霭袅袅，祥云漂浮，阳光先落在山头金顶之处。\n" +
		"\n" +
		"　　金顶琉璃大殿迸发出金光万道，照耀云海，极为夺目。\n" +
		"\n" +
		"　　而在云海环绕的群山之间，一座座宏伟古朴的大殿如同漂浮在云海之上，神圣肃穆而又庄严。\n" +
		"\n" +
		"　　这里便是十万里大荒，三千人族部落共同的圣地，剑门！\n" +
		"\n" +
		"　　剑门炼气士辈出，守护十万里大荒，三千人族部落所有人无不以成为剑门的炼气士为至高荣耀。\n" +
		"\n" +
		"　　大荒环境恶劣，人族弱小，没有剑门守护大荒，只怕三千部落早已灰飞烟灭。\n" +
		"\n" +
		"　　山门高耸，山门后便是剑门的入门弟子的栖息地，生活着数万的入门弟子。\n" +
		"\n" +
		"　　剑门中炼气士颇多，三千部落送来族中的少年少女上山学艺，如果没有深厚背景便多数生活在这里。而有背景的部落往往在剑门中有炼气士，可以直接将子弟送入其门下。\n" +
		"\n" +
		"　　钟岳早早的起床，光着膀子站在水井边打上来一桶水，从自己头顶浇下去，然后猛地打了个激灵，将昏睡赶走。\n" +
		"\n" +
		"　　清水从他身上滑落，在青石板上溅起水花。\n" +
		"\n" +
		"　　他的肌肉结实，身材匀称，皮肤紧紧绷在肌肉之上，显得很有力量，而在他前胸则有三道深深的爪痕，不知是什么猛兽留下，已经结疤。\n" +
		"\n" +
		"　　钟岳转过身来，后背上也有一道道爪痕，他的左臂之上也有猛兽咬伤留下的疤痕，他身上竟有十几处大大小小的疤痕，浑然不像是一个年仅十五岁的少年。\n" +
		"\n" +
		"　　钟岳背起药篓，悄然无息走出山门，向山下走去。\n" +
		"\n" +
		"　　外门弟子的地位极为低微，能够学到的只是剑门最为粗浅的一些功法，只有修成灵，才可以成为内门的记名弟子，拜在内门堂主的门下，得到剑门真正的传承。不过没有背景的外门弟子想要成为内门记名弟子，是何其艰难？\n" +
		"\n" +
		"　　大荒三千人族部落，小部落上万人，大部落有几百万人之多，无数人削尖脑袋往剑门中钻，都想成为剑门的内门记名弟子，成为炼气士，因此竞争激烈。\n" +
		"\n" +
		"　　剑门有着剑门的规矩，若是十六岁之前无法修成灵，便会赶出剑门。大荒大小部落族长的子女自然有着各种灵药灵丹，来提升修为，栽培子女在十六岁之前修成灵。\n" +
		"\n" +
		"　　即便是普通的资质，只要有足够的灵药灵丹，都可以靠灵药灵丹堆成炼气士！\n" +
		"\n" +
		"　　而其他贫民平民的子女则没有这个待遇了，只能靠自己勤修苦练。\n" +
		"\n" +
		"　　寒门难出贵子，穷困人家很少有人能够成为炼气士。\n" +
		"\n" +
		"　　钟岳出身自钟山部落，是一个微不足道的小部落，因为连年灾荒，只剩下百十来个人，可以说是大荒中最小的部落。\n" +
		"\n" +
		"　　这样的部落连自保都成问题，更何况供出一个炼气士？\n" +
		"\n" +
		"　　因此钟岳尽管比别人努力百倍，但还是距离修成灵有一段不小的差距。\n" +
		"\n" +
		"　　他这次这么早下山，便是为了在深山老林中搜寻几位灵药来炼制羽灵丹，温养魂魄。\n" +
		"\n" +
		"　　羽灵丹是最为普通的丹药，炼制羽灵丹所需要的药材也是普普通通的药材，但即便是这样普通灵丹灵药他也买不起，只能自己炼制。\n" +
		"\n" +
		"　　自己采药自己炼丹，花费的时间吃的苦头，自然比别人多得多。\n" +
		"\n" +
		"　　钟岳离开剑门山约莫过了两个时辰，天色已经大亮，剑门山内门的弟子和外门的弟子都早已起来，各自修炼，突然只听山上传来急促的钟声，一位位气息强大的炼气士从山顶飞落，远远便高声喝道：“魔魂阴瘴将现，剑门所有弟子听令，所有人严禁外出！”\n" +
		"\n" +
		"　　“所有人禁止离开剑门山半步！”\n" +
		"\n" +
		"　　“魔魂阴瘴危险无比，唯有剑门能够守护一方，任何人不得离开剑门，否则必死无疑！”\n" +
		"\n" +
		"　　……\n" +
		"\n" +
		"　　剑门上下一片哗然，只见轰隆一声，宏伟的山门陡然关闭，但见剑门山半空中，云雾缭绕之间，一座座宫阙光芒大放，金顶更是万道金光爆射，照耀虚冥，璀璨无比！\n" +
		"\n" +
		"　　这样严阵以待的大阵势，外门弟子还是头一次见到，不过对于内门弟子来说却并不陌生。\n" +
		"\n" +
		"　　魔魂阴瘴每隔十年一次，凶险无比，即便是炼气士遇到魔魂阴瘴也会死得惨不忍睹，每一次魔魂阴瘴爆发都会血洗千里之地，所过之处寸草不生！\n" +
		"\n" +
		"　　“这魔魂阴瘴怎么会提前爆发？按照时间来说，应该五天之后才会爆发？”一位内门弟子喃喃道。\n" +
		"\n" +
		"　　正在此时，突然地底传来沉闷的声响，如同有魔怪在地底兴风作浪，突然剑门山不远处的一座深谷之中有滚滚的黑气涌出，如同喷泉一般咕嘟咕嘟上空喷射黑霾！\n" +
		"\n" +
		"　　很快，这道黑柱便比剑门山还要高，笔直入云，然后黑霾向四面八方散去，这幅场面，仿佛有一把巨大无朋的黑伞在徐徐张开一般！\n" +
		"\n" +
		"　　天地间顿时一片漆黑，唯有剑门山光芒大方，照亮黑霾，滚滚涌动的黑霾从上方压下，来到剑门山附近，便被光芒挡在外面，仿佛有一层无形的光幕在守护着剑门山，让黑霾无法浸入山中。\n" +
		"\n" +
		"　　而在那黑霾之中似乎还有恐怖的生灵，发出让人头皮发麻的怒吼声，时不时黑霾中的生灵撞击在剑门山的光幕上，传来一声声沉闷的巨响，惊人至极。\n" +
		"\n" +
		"　　剑门山高处，一座大殿前，几位炼气士仰望这场恐怖无比的魔魂阴瘴，有人低声道：“外门弟子有几人走出山门，至今未回，只怕有去无回了……”\n" +
		"\n" +
		"　　钟岳前去采药的地方名叫聚云山，聚云山中多灵药，位于剑门山东南一带，他这几年在剑门中做外门弟子，虽然没有学到什么高深的功法，但却炼得身体强健，一步便可跨越丈余距离，翻山越岭轻松无比。\n" +
		"\n" +
		"　　待他走入聚云山，天色已经亮了，山中时不时传来一声声兽吼。\n" +
		"\n" +
		"　　这里人迹罕至，附近也没有什么部落打猎，山中的猛兽极多，钟岳小心翼翼在山林间行走，四处寻觅，没过多久便采摘了几味灵药。\n" +
		"\n" +
		"　　“其他的灵药都好寻，唯独这一味五香芝难寻，需要碰运气。”\n" +
		"\n" +
		"　　钟岳翻山越岭，突然隐约嗅到一股奇特的药香味，那药香味若有若无，但随着他渐渐走近药香便越来越浓。\n" +
		"\n" +
		"　　这股药香共有五种奇特的气味儿，甘甜、芬芳、清爽、火烈、醇香，正是五香芝的气味儿！\n" +
		"\n" +
		"　　他循着气味前行，来到一座山崖边，俯身向下看去，只见山崖陡峭，乱石突出，谷中幽深，深不见底。\n" +
		"\n" +
		"　　在山崖十多丈远近处有一块突起的巨石，有细细的水流从崖壁上渗出，滋润着几株异草。\n" +
		"\n" +
		"　　“五香芝！”\n" +
		"\n" +
		"　　钟岳心中一喜，小心翼翼沿着山崖攀岩而下，山崖虽陡，但是他身手极佳，却也没有多少危险。\n" +
		"\n" +
		"　　过了片刻，他便来到距离那块巨石不远处，向下看去，只见深谷黑漆漆一片，冷风从下向上吹，冰寒刺骨。\n" +
		"\n" +
		"　　钟岳愈发小心，终于来到那块突起的巨石上，正欲采摘五香芝，突然天空昏暗下来，他急忙抬头看去，心头一惊。\n" +
		"\n" +
		"　　只见一头金光灿灿的大鸟飞临山崖，那大鸟翼展丈余，竟然长着两对翅膀，正拍动双翼向他这边俯冲下来，利爪闪露铮铮寒光！\n" +
		"\n" +
		"　　“这是什么猛禽？”\n" +
		"\n" +
		"　　那头四翼金鸟还未扑至，猎猎的罡风便铺面而来，打在脸上生疼，几乎将钟岳从巨石上掀下！\n" +
		"\n" +
		"　　呼——\n" +
		"\n" +
		"　　四翼金鸟扑击而来，钟岳在它扑至的一瞬间急忙抓住几株五香芝，然后纵身一跃从巨石上跃下，这头大鸟扑空，扑闪着四翅飞起，四下搜寻，却见钟岳并没有坠落山崖，而是在巨石下方一丈多远处抓住一根青藤。\n" +
		"\n" +
		"　　四翼金鸟戾啸，冲天而起，准备再次扑击，钟岳咬了咬牙沿着青藤向深谷中滑去，那四翼金鸟刚刚飞至半空，忽然滚滚的黑霾涌来，霎时间将整个山谷笼罩，钟岳抬头向上看去，仿佛天被黑布盖住了一般。\n" +
		"\n" +
		"　　谷底隐约还有光线，看不清是什么东西发光，突然钟岳只听头顶风声传来，只见一个巨大的骨架从上空掉落，经过他的身边坠入深谷之中。\n" +
		"\n" +
		"　　他心中一惊，只见那骨架正是刚才那头四翼金鸟的骨架！\n" +
		"\n" +
		"　　短短片刻，这头四翼金鸟便仿佛被黑霾中的什么东西吃掉了一般，只剩下骨骼！\n" +
		"\n" +
		"　　钟岳毛骨悚然，抬头看去，只见黑霾沿着山崖向自己这边而来，速度极快。他连忙顺着飞速滑下，突然嘣嘣几声青藤从崖壁上脱落，钟岳连同青藤一起从崖壁上掉落下去。\n" +
		"\n" +
		"　　慌乱中他伸手四处乱抓，终于抓住一株从崖壁凸起的古树枝杈，下坠的身形这才止住。钟岳抬头看去，黑霾侵袭距离自己只有四五丈的距离，而在这株粗壮的古树旁边还有一个水缸粗细的洞口，洞口中传来悉悉索索的声音，一个巨大的三角头颅从洞口中探出，然后高高抬起，饶有趣味的盯着钟岳，赫然是一头大的无法想象的巨蟒！\n" +
		"\n" +
		"　　巨蟒口中嘶嘶有声，对他很有兴趣。\n" +
		"\n" +
		"　　这等大蟒绞杀力惊人，是大荒异兽中的王者，即便是炼气士斩杀这等凶兽都有些困难，更何况是他？\n" +
		"\n" +
		"　　钟岳咬牙，松开枝杈，身躯顿时坠落。\n" +
		"\n" +
		"　　那头巨蟒嘶嘶的吐着长长的蛇信子，正欲扑击，突然黑霾笼罩，将巨蟒吞没。\n" +
		"\n" +
		"　　哗啦，一条长达十多丈的蛇骨从黑霾中坠落，与钟岳一前一后坠入谷底。\n" +
		"\n" +
		"　　寒谷幽深，枯枝败叶在谷底铺了厚厚的一层，钟岳落地并没有受到多大的冲击，少年借着微弱的光线四下看去，只见谷底尸骨堆积，鬼火点点，应该是死在那头大蟒和怪鸟口中的野兽尸骨。\n" +
		"\n" +
		"　　“刚才那巨蟒也死了，这黑雾到底是……糟了！”\n" +
		"\n" +
		"　　钟岳脸色剧变，黑霾终于也到了谷底，四下涌来，鬼火一朵接着一朵相继消失在黑霾之中。\n" +
		"\n" +
		"　　钟岳四下看去，只见黑霾涌来，近在咫尺，不由暗叹一声：“这怪雾吃了金鸟和巨蟒，只怕我也必死无疑……咦，这些黑雾怎么不动了？”\n" +
		"\n" +
		"　　黑霾涌到他身边丈余之地突然停止前进，仿佛被一股无形的力量挡在外面，形成一个半球状的守护圈。\n" +
		"\n" +
		"　　钟岳看到黑霾中一个巨大的白骨爪子抓来，抓住这个半球状的守护圈，发出咯吱咯吱的刺耳声响，却没能抓破。\n" +
		"\n" +
		"　　那白骨爪子不知是什么怪物，单单一个指节都比他还要高大！\n" +
		"\n" +
		"　　要知道，钟岳这几年磨练筋骨，身子骨比成年人还要高大几分，而这白骨爪子竟然连一根指节都比他大了许多，实难想象白骨爪子的主人到底有多大！\n" +
		"\n" +
		"　　“这是……”\n" +
		"\n" +
		"　　钟岳看到就在这不大的守护圈的中央，有一具跏趺而坐的尸骨，这具尸骨右臂扬起，手中提着一盏灯，似乎为黑暗中的人们照明道路。\n" +
		"\n" +
		"　　灯光幽幽，比鬼火亮不了多少，似乎随时都有可能熄灭。\n" +
		"\n" +
		"　　“奇怪，此人已经死了这么多年，只剩下骨骼，怎么这盏灯却还没有灭？”\n" +
		"\n" +
		"　　钟岳好奇万分，上前细细打量，这才发现奇特之处，这具骨骼并不能称之为人骨，也不是跏趺而坐，而是盘坐。\n" +
		"\n" +
		"　　之所以称作盘，并非是盘膝，是因为此人没有双腿，只有一条长长的蛇尾，蛇尾盘绕在一起，而他的上半身却是人形，有头有颈，有手有臂！\n" +
		"\n" +
		"　　这是一尊人首蛇身的怪人的尸骨！\n" +
		"\n" +
		"　　“难道是这盏灯挡住了这些奇怪的黑雾？”\n" +
		"\n" +
		"　　钟岳向那怪人尸骨拜了拜，抬手小心翼翼取下这盏灯，只见灯焰摇晃，随时可能熄灭，他连忙用手护住，突然只听一个慵懒的声音传来：“大梦几千秋，今夕是何年？少年，如今是第几朝伏羲在位？”"
}

export default {
	chapterContent,
	chapterList
}
